In [1]:
#Q1

In [2]:
# Label encoding would not consider whether a variable is ordinal or not, but in the case of ordinal encoding, it will assign a sequence of numerical values as per the order of data.

In [2]:
#Example 
customer={'ratings':['Good','Bad','Ugly'],
          'state':['Maharastra','Jharkhand','Goa']
         }
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame(customer)

In [6]:
# For Rating we will use Ordinal Encoding whereas for Region we may use Label Encoding as order does not matter.

In [9]:
#Q2

In [11]:
# target ordinal encoding can be used in case of a relationship between the target variable and Encoded Variable.

In [6]:
#Example
df=pd.DataFrame({'City':['LA','NY','TX','MU','LIV','LA'],
                 'Rate':[234,245,190,222,210,213]})

In [4]:
df

  City  Population
0   LA         234
1   NY         245
2   TX         190
3   MU         222
4  LIV         210

In [27]:
mean_price=df.groupby('City')['Rate'].mean().to_dict()

In [29]:
mean_price

{'LA': 223.5, 'LIV': 210.0, 'MU': 222.0, 'NY': 245.0, 'TX': 190.0}

In [30]:
df['city_encoded']=df['City'].map(mean_price)

In [34]:
df.drop('City',axis=1)

   Rate  city_encoded
0   234         223.5
1   245         245.0
2   190         190.0
3   222         222.0
4   210         210.0
5   213         223.5

In [35]:
import seaborn as sns

In [36]:
df=sns.load_dataset('tips')

In [38]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [42]:
mean_bill1=df.groupby('day')['total_bill'].mean().to_dict()
mean_bill2=df.groupby('time')['total_bill'].mean().to_dict()

In [47]:
mean_bill2

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [44]:
df['day_encoded']=df['day'].map(mean_bill1)

In [51]:
df['time_encoded']=df['time'].map(mean_bill2)

In [55]:
df.drop(['day','time'],axis=1,inplace=True)
df.head()

   total_bill   tip     sex smoker  size day_encoded time_encoded
0       16.99  1.01  Female     No     2       21.41    20.797159
1       10.34  1.66    Male     No     3       21.41    20.797159
2       21.01  3.50    Male     No     3       21.41    20.797159
3       23.68  3.31    Male     No     2       21.41    20.797159
4       24.59  3.61  Female     No     4       21.41    20.797159

In [58]:
#Q3
# covariance is a measure of the relationship between two random variables.
#Covariance and correlation greatly aid in understanding the relationship between two continuous variables. Covariance indicates whether two variables fluctuate in the same (positive covariance) or opposite direction (negative covariance). 
#The numerical value of covariance has no importance; only the sign is relevant

In [59]:
#Covarience is given by the summation of (Xi-X.mean)(Yi-Y.mean)/n-1 for i=1 to n

In [62]:
#Q4
df=pd.DataFrame({'Color': ['red', 'green', 'blue'], 'Size': ['small', 'medium','large'],'Material' :['wood', 'metal','plastic']})

In [76]:
from sklearn.preprocessing import LabelEncoder
import warnings
warnings.filterwarnings('ignore')

In [64]:
encoder=LabelEncoder()

In [79]:
encoded1=encoder.fit_transform(df[['Color']])
encoded2=encoder.fit_transform(df[['Size']])
encoded3=encoder.fit_transform(df[['Material']])

array([2, 1, 0])

In [80]:
pd.DataFrame({'Color': encoded1, 'Size': encoded2, 'Material':encoded3})

   Color  Size  Material
0      2     2         2
1      1     1         0
2      0     0         1

In [81]:
#Q5
#Calculate the covariance matrix for the following variables in a dataset: Age, Income, and Education
#level. Interpret the results.

In [83]:
df=pd.DataFrame({'Age':[21,27,33,42,55],'Income':[23,45,106,109,155],
                'Education':['Btech','Ba','Bca','BBM','MBA']})

In [84]:
df

   Age  Income Education
0   21      23     Btech
1   27      45        Ba
2   33     106       Bca
3   42     109       BBM
4   55     155       MBA

In [85]:
df.cov()

           Age   Income
Age     177.80   676.55
Income  676.55  2831.80

In [86]:
#Q6

In [90]:
df=pd.DataFrame({"Gender" :['Male','Female','Male','Female'], 
              "Education Level":['High School','Bachelors','Masters','PhD'],
              "Employment Status": ['Unemployed','Part-Time','Full-Time','Full-time']})

In [91]:
df

   Gender Education Level Employment Status
0    Male     High School        Unemployed
1  Female       Bachelors         Part-Time
2    Male         Masters         Full-Time
3  Female             PhD         Full-time

In [92]:
from sklearn.preprocessing import OneHotEncoder

In [93]:
#Since Gender has only two unique values We can use Onehot Encoder. For others we can use ordinal encoding since there order.

In [95]:
# Q7
# "Temperature" and "Humidity", and two
# categorical variables, "Weather Condition" (Sunny/Cloudy/Rainy) and "Wind Direction" (North/South/
# # East/West).
np.random.randint(0,40,12)

array([37, 11, 14, 20,  7, 29, 35, 32, 37,  2, 35, 31])

In [96]:
df=pd.DataFrame({"Temperature":np.random.randint(0,40,12),
              "Humidity":np.random.randint(0,40,12),
              "Weather_Condition":np.repeat(['Sunny','Cloudy','Rainy'],4),
              "Wind_Direction":np.repeat(['North','South','East','West'],3)
             })

In [97]:
df

    Temperature  Humidity Weather_Condition Wind_Direction
0            37        35             Sunny          North
1            35        11             Sunny          North
2            18         6             Sunny          North
3            20        39             Sunny          South
4            32        14            Cloudy          South
5            32        32            Cloudy          South
6            28        11            Cloudy           East
7            25        32            Cloudy           East
8             8        16             Rainy           East
9             9        24             Rainy           West
10           29        24             Rainy           West
11           23        38             Rainy           West

In [113]:
df.cov()

             Temperature    Humidity
Temperature    89.878788    9.636364
Humidity        9.636364  135.727273